// 客户角色
export const K_CustomerRole = [
	{ "1": "主借人" },
	{ "2": "配偶" },
	{ "3": "担保人(自然人)" },
	{ "4": "共借人" },
	{ "6": "共借人与配偶" }
];
// 证件类型
export const K_IDType = [
	{ "1": "身份证" },
	{ "2": "户口簿" },
	{ "3": "中国护照" },
	{ "4": "军官证" },
	{ "5": "士兵证" },
	{ "6": "港澳居民往来内地通行证" },
	{ "7": "台湾居民来往大陆通行证" },
	{ "8": "临时身份证" },
	{ "9": "外国护照" },
	{ "10": "警官证" },
	{ "11": "其它个人证件" },
];
export const K_OnlyIDType = [
	{ "1": "身份证" },
]
// 居住状况
export const K_LiveType = [
	{ "1": "自购无按揭" },
	{ "2": "按揭" },
	{ "3": "亲属住房" },
	{ "4": "宅基地房" },
	{ "5": "租房" },
];
// 职业类型
export const K_JobType = [
	{ "1": "授薪" },
	{ "2": "自雇" },
	// { "3": "自由职业" },
];
// 教育程度
export const K_EducationLevel = [
	{ "1": "博士及以上" },
	{ "2": "硕士" },
	{ "3": "本科" },
	{ "4": "大专" },
	{ "5": "高中/中专" },
	{ "6": "初中及以下" },
];
// 最高学位
export const K_HighestEducation = [
	{ "1": "名誉博士" },
	{ "2": "博士" },
	{ "3": "硕士" },
	{ "4": "学士" },
	{ "5": "其他" },
];
// 对账单邮寄地址类型
export const K_StatementType = [
	{ "1": "居住地址" },
	{ "2": "单位地址" },
];
// 婚姻状况
export const K_IsMarryArray = [
	{ "1": "未婚" },
	{ "2": "已婚" },
	// { "3": "丧偶" },
	// { "4": "离异" }
];

/**
 * 婚姻状况
 * @returns {Array}
 * @example { text: "未婚", value: "1" }
 * 
 */
export const K_IsMarryArrayFormatted = K_IsMarryArray.map(item => {
	const key = Object.keys(item)[0];
	const value = item[key];
	return { text: value, value: key };
  });
// 与主借人关系
export const K_Relation = [
	{ "1": "本人" },
	{ "2": "配偶" },
	{ "3": "父母" },
	{ "4": "子女" },
	{ "5": "兄弟姐妹" },
	{ "6": "同事" },
	{ "7": "其他" }
];
export const K_OtherGJRelation = [
	{ "1": "父母或子女" },
	{ "2": "兄弟姐妹" },
	{ "3": "同事" },
	{ "4": "同学" },
	{ "5": "朋友" },
];
export const K_LesseeRelation = [
	{ "3": "父母" },
	{ "4": "子女" },
	{ "5": "兄弟姐妹" },
	{ "7": "其他" },
];
// 业务类型
export const K_BusinessType = [
	{ "3": "车抵贷" },
];
export const K_LicenseType = [
	{ "2": "私牌" },
];
// 车辆类型
export const K_VehicleType = [
	{ "01": "国产车" },
	{ "01E": "国产新能源车" },
	{ "02": "进口车" },
	{ "02E": "进口新能源车" },
	{ "03": "合资车" },
	{ "03E": "合资新能源车" }
];
// 变速箱类型
export const K_GearboxType = [
	// { "01": "CVT无极变速" },
	// { "02": "CVT电子无级变速" },

	{ "11": "自动" },
	{ "10": "手动" },
	{ "03": "手自一体" },

	
	// { "04": "无级/手动一体式" },
	// { "05": "1档 无级/手动一体式" },
	// { "06": "3档 自动" },
	// { "07": "4档 手动" },
	// { "08": "4档 自动" },
	// { "09": "4档 手自一体" },
	// { "10": "5档 手动" },
	// { "11": "5档 自动" },
	// { "12": "5档 手自一体" },
	// { "13": "5档 连续手自一体" },
	// { "14": "5档 无级/手动一体式" },
	// { "15": "6档 手动" },
	// { "16": "6档 自动" },
	// { "17": "6档 手自一体" },
	// { "18": "6档 连续手自一体" },
	// { "19": "6档 无级/手动一体式" },
	// { "20": "7档 自动" },
	// { "21": "7档 手自一体" },
	// { "22": "7档 手动一体式" },
	// { "23": "7档 无级/手动一体式" },
	// { "24": "8档 手自一体" },
	// { "25": "8档 无级/手动一体式" },
	// { "26": "8档 自动" },
	// { "27": "9档 自动" },
	// { "28": "9档 手自一体" },
	// { "29": "9档 无级/手动一体式" },
	// { "30": "10档 自动" },
	// { "31": "10档 手自一体" },
	// { "32": "10档 无极/手动一体式" },
	// { "33": "半自动" },
	// { "34": "纯电动车单速变速箱" },
];
// 评级
export const K_Rate = [
	{ "excellent": "优" },
	{ "good": "良" },
	{ "average": "中" },
	{ "pool": "差" },
];
// 燃油类型
export const K_OilType = [
	{ "1": "无铅汽油98#" },
	// { "2": "无铅汽油97#" },
	// { "3": "无铅汽油97#/电混合" },
	// { "4": "无铅汽油93#" },
	// { "5": "无铅汽油93#/压缩天然气(CNG)" },
	// { "6": "无铅汽油90#" },
	// { "7": "无铅汽油90#/液化石油气(LPG)" },
	// { "8": "无铅汽油90#/电混合" },
	// { "9": "无铅汽油90#/压缩天然气(CNG)" },
	// { "10": "柴油0#" },
	// { "11": "柴油5#" },
	// { "12": "柴油-10#" },
	// { "13": "无铅汽油93#/液化石油气(LPG)" },
	{ "14": "无铅汽油95#" },
	// { "15": "柴油-20#" },
	// { "16": "柴油-35#" },
	// { "17": "柴油-50#" },
	// { "18": "压缩天然气(CNG)" },
	// { "19": "液化石油气(LPG)" },
	// { "20": "无铅汽油89#" },
	{ "21": "无铅汽油92#" },
	// { "22": "无铅汽油89#/压缩天然气(CNG)" },
	// { "23": "无铅汽油89#/液化石油气(LPG)" },
	// { "24": "无铅汽油92#/压缩天然气(CNG)" },
	// { "25": "无铅汽油92#/液化石油气(LPG)" },
	// { "26": "无铅汽油95#/压缩天然气(CNG)" },
	// { "27": "无铅汽油95#/液化石油气(LPG)" },
	// { "28": "无铅汽油89#/电混合" },
	// { "29": "无铅汽油92#/电混合" },
	// { "30": "无铅汽油93#/电混合" },
	// { "31": "无铅汽油95#/电混合" },
	// { "32": "甲醇" },
	// { "33": "乙醇" },
	{ "34": "纯电动" },
	// { "35": "柴油0#/电混合" },
	// { "36": "柴油0#/压缩天然气(CNG)" },
	// { "45": "汽油CNG双燃料" },
	// { "46": "柴油CNG双燃料" },
	{ "47": "汽油电混合" },
	// { "48": "柴油电混合" },
	{ "52": "插电式" },
	{ "53": "增程式" },
	{ "54": "氢燃料" },
];
// 车辆抵押情况
export const K_MortgageSituation = [
	{ "1": "从未抵押" },
	{ "2": "抵押中" },
	{ "3": "已解抵押" },
];
// 民族
export const K_Nation = [
	{ "1": "汉族" },
	{ "2": "蒙古族" },
	{ "3": "回族" },
	{ "4": "藏族" },
	{ "5": "维吾尔族" },
	{ "6": "苗族" },
	{ "7": "彝族" },
	{ "8": "壮族" },
	{ "9": "布依族" },
	{ "10": "朝鲜族" },
	{ "11": "满族" },
	{ "12": "侗族" },
	{ "13": "瑶族" },
	{ "14": "白族" },
	{ "15": "土家族" },
	{ "16": "哈尼族" },
	{ "17": "哈萨克族" },
	{ "18": "傣族" },
	{ "19": "黎族" },
	{ "20": "僳僳族" },
	{ "21": "佤族" },
	{ "22": "畲族" },
	{ "23": "高山族" },
	{ "24": "拉祜族" },
	{ "25": "水族" },
	{ "26": "东乡族" },
	{ "27": "纳西族" },
	{ "28": "景颇族" },
	{ "29": "柯尔克孜族" },
	{ "30": "土族" },
	{ "31": "达斡尔族" },
	{ "32": "仫佬族" },
	{ "33": "羌族" },
	{ "34": "布朗族" },
	{ "35": "撒拉族" },
	{ "36": "毛难族" },
	{ "37": "仡佬族" },
	{ "38": "锡伯族" },
	{ "39": "阿昌族" },
	{ "40": "普米族" },
	{ "41": "塔吉克族" },
	{ "42": "怒族" },
	{ "43": "乌孜别克族" },
	{ "44": "俄罗斯族" },
	{ "45": "鄂温克族" },
	{ "46": "崩龙族" },
	{ "47": "保安族" },
	{ "48": "裕固族" },
	{ "49": "京族" },
	{ "50": "塔塔尔族" },
	{ "51": "独龙族" },
	{ "52": "鄂伦春族" },
	{ "53": "赫哲族" },
	{ "54": "门巴族" },
	{ "55": "珞巴族" },
	{ "56": "基诺族" },
];
/**
 * 民族
 * @returns {Array}
 * @example { text: "汉族", value: "1" }
 * 
 */
export const K_NationFormatted = K_Nation.map(item => {
	const key = Object.keys(item)[0];
	const value = item[key];
	return { text: value, value: key };
  });
// 行业类别
export const K_Sector = [
	{ "1": "农、林、牧、渔业" },
	// { "2": "采矿业" },
	{ "3": "制造业" },
	// { "4": "电力、热力、燃气及水生产和供应业" },
	{ "5": "建筑业" },
	{ "6": "批发和零售业" },
	// { "7": "交通运输、仓储和邮政业" },
	{ "8": "住宿和餐饮业" },
	{ "9": "信息传输、软件和信息技术服务业" },
	// { "10": "金融业" },
	{ "11": "房地产业" },
	// { "12": "租赁和商务服务业" },
	// { "13": "科学研究和技术服务业" },
	// { "14": "水利、环境和公共设施管理业" },
	// { "15": "居民服务、修理和其他服务业" },
	// { "16": "教育" },
	// { "17": "卫生、社会保障和社会福利业" },
	// { "18": "文化、体育和娱乐业" },
	// { "19": "公共管理和社会组织" },
	// { "20": "国际组织" },
	{ "21": "未知" }
]
// 单位性质
export const K_CompanyNature = [
	{ "1": "党政机关" },
	{ "2": "事业单位" },
	{ "3": "国有企业" },
	{ "4": "有限责任公司" },
	{ "5": "股份有限公司" },
	{ "6": "外资(含港、澳、台)" },
	{ "7": "中外合资 (含港、澳、台)" },
	{ "8": "私营企业" },
	{ "9": "个体经营" },
	{ "10": "其他" },
]
// 职务
export const K_Position = [
	{ "1": "高层" },
	{ "2": "中层" },
	{ "3": "基层" },
	{ "4": "一般员工" },
	{ "5": "其他" },
]
// 驾照类型
export const K_DriverLicenseType = [
	{ "01": "本人驾驶证" },
	{ "02": "关系人驾驶证" },
]
// 职业
export const K_IndivPro = [
	{ "1": "国家机关、党群组织、企业、事业单位负责人" },
	{ "2": "专业技术人员" },
	{ "3": "办事人员和有关人员" },
	{ "4": "商业、服务业人员" },
	{ "5": "农、林、牧、渔、水利业生产人员" },
	{ "6": "生产、运输设备操作人员及有关人员" },
	{ "X": "军人" },
]
// 职称
export const K_Profsn = [
	{ "01": "无" },
	{ "10": "高级" },
	{ "20": "中级" },
	{ "30": "初级" },
	{ "99": "未知" },
]
// 国籍
export const K_Nationality = [
	{ "1": "中华人民共和国" },
]
// 性别
export const K_Sex = [
	{ "1": "男" },
	{ "2": "女" },
]